In [40]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

# Control Sub-Tree Analysis

## 1. Get necessary data from Database

In [24]:
db_connection_str = 'mysql+pymysql://root:db@localhost/GDE'
db_connection = create_engine(db_connection_str)

In [25]:
control_subtree_subjects = ['EM306', 'EM404', 'ES601', 'EM607', 'ES710', 'ES626', 'ES827', 'ES728', 'ES828']
control_subtree_regex = [subject_codename + '.*' for subject_codename in control_subtree_subjects]

control_subtree_df = pd.read_sql("SELECT * FROM Subject WHERE SubjectName REGEXP '"+"|".join(control_subtree_regex) + "'", db_connection)
control_subtree_df

     ID                                        SubjectName
0  2093                                   EM306 - Estática
1  2099                                   EM404 - Dinâmica
2  2120            EM607 - Vibrações de Sistemas Mecânicos
3  2593                 ES601 - Análise Linear de Sistemas
4  2596  ES626 - Modelagem de Dispositivos Eletromecânicos
5  2605             ES710 - Controle de Sistemas Mecânicos
6  2612              ES728 - Controle Avançado de Sistemas
7  2621                        ES827 - Robótica Industrial
8  2622        ES828 - Laboratório de Controle de Sistemas

In [82]:
target_subject_ids = ','.join(str(subject_db_id) for subject_db_id in control_subtree_df['ID'].to_list())
subjects_scores = pd.read_sql("SELECT ProfessorID, SubjectID, Coerente, ExplicaBem, Facilidade FROM ProfessorRankings WHERE SubjectID IN ({ids})".format(ids = target_subject_ids), db_connection)
subjects_scores

    ProfessorID  SubjectID  Coerente  ExplicaBem  Facilidade
0            35       2093       3.0         2.0         3.0
1           408       2093       3.0         4.0         2.0
2           410       2093       4.0         2.0         4.0
3           405       2093       2.0         2.0         1.0
4           411       2093       4.0         4.0         3.0
..          ...        ...       ...         ...         ...
71         1332       2622       NaN         NaN         NaN
72         3014       2622       4.0         4.0         2.0
73         3111       2622       NaN         NaN         NaN
74         3288       2622       NaN         NaN         NaN
75         5582       2622       NaN         NaN         NaN

[76 rows x 5 columns]

## 2. Subject Ranking

The first analysis we will do is, through the use of fuzzy numbers to represent the 5-star scores, aggregate all the professors' scores for a subject and compare to others related subjects (in our case subjects that are part of the control systems subtree). 

This analysis might give us a deeper insight into which subject students might find the most challenging (be it due to the subject itself or the professors teaching methods), and identify benchmark subjects to help improve other subjects/professor's technics.

### 2.1 Cleaning Data

Some professors history in a specific subject may not have the minimum number of entries for scores, so they appear as NaN on the scores dataframe and need to be removed.

In [83]:
subjects_scores = subjects_scores.dropna()
subjects_scores

    ProfessorID  SubjectID  Coerente  ExplicaBem  Facilidade
0            35       2093       3.0         2.0         3.0
1           408       2093       3.0         4.0         2.0
2           410       2093       4.0         2.0         4.0
3           405       2093       2.0         2.0         1.0
4           411       2093       4.0         4.0         3.0
..          ...        ...       ...         ...         ...
66         3275       2621       2.0         1.0         2.0
67         4131       2621       4.0         3.0         3.0
69          443       2622       3.0         3.0         3.0
70          467       2622       3.0         3.0         3.0
72         3014       2622       4.0         4.0         2.0

[63 rows x 5 columns]

### 2.2 Expanding 5-Star Review to Triangular Fuzzy Numbers

![](../docs/imgs/Linguistic-five-Likert-scale-using-triangular-fuzzy-number.png)

[Reference](https://www.researchgate.net/figure/Linguistic-five-Likert-scale-using-triangular-fuzzy-number_tbl1_365957303)

In [84]:
crisp_to_fuzzy = {1.0 : np.array([1, 1, 2]), 2.0: np.array([1, 2, 3]), 3.0: np.array([2, 3, 4]), 4.0:  np.array([3, 4, 5]), 5.0: np.array([4, 5, 5])}

In [85]:
fuzzy_subjects_scores = subjects_scores.copy()

for col in ['Coerente', 'ExplicaBem', 'Facilidade']:
    fuzzy_subjects_scores[col] = subjects_scores[col].apply(lambda val: crisp_to_fuzzy[val])

In [86]:
fuzzy_subjects_scores

    ProfessorID  SubjectID   Coerente ExplicaBem Facilidade
0            35       2093  [2, 3, 4]  [1, 2, 3]  [2, 3, 4]
1           408       2093  [2, 3, 4]  [3, 4, 5]  [1, 2, 3]
2           410       2093  [3, 4, 5]  [1, 2, 3]  [3, 4, 5]
3           405       2093  [1, 2, 3]  [1, 2, 3]  [1, 1, 2]
4           411       2093  [3, 4, 5]  [3, 4, 5]  [2, 3, 4]
..          ...        ...        ...        ...        ...
66         3275       2621  [1, 2, 3]  [1, 1, 2]  [1, 2, 3]
67         4131       2621  [3, 4, 5]  [2, 3, 4]  [2, 3, 4]
69          443       2622  [2, 3, 4]  [2, 3, 4]  [2, 3, 4]
70          467       2622  [2, 3, 4]  [2, 3, 4]  [2, 3, 4]
72         3014       2622  [3, 4, 5]  [3, 4, 5]  [1, 2, 3]

[63 rows x 5 columns]